Catalogs/Renault_СервисныеАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_СервисныеАкции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяАкция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставляетсяНаЗаказНаряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаВПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаВРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпенсацияВРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запчасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВПроцентах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпенсацияВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВПроцентах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпенсацияВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_СервисныеАкции/Forms/ПодборЭлементовАкции/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособПоиска="НачалоСтроки";

	ИмяТЧ=Параметры.ТЧ;
	Заголовок=Заголовок+" ("+ИмяТЧ+")";
	
	Если ИмяТЧ="Запчасти" Тогда
		//отбор по списку запчастей
		Сп=Новый СписокЗначений;
		Сп.ЗагрузитьЗначения(Параметры.ВидыНоменклатуры);
		Список.Отбор.Элементы[0].Использование=Истина;
		Список.Отбор.Элементы[0].ПравоеЗначение=Сп;
	ИначеЕсли ИмяТЧ="Работы" Тогда
		Список.ОсновнаяТаблица="Справочник.Автоработы";	
	КонецЕсли;
	
КонецПроцедуры

//+выбор
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) СтандартнаяОбработка=Ложь; Выбор(ВыбраннаяСтрока) КонецПроцедуры
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка) СтандартнаяОбработка=Ложь; Выбор(Элемент.ВыделенныеСтроки) КонецПроцедуры
&НаКлиенте
Процедура Выбор(ВыбранноеЗначение) ВладелецФормы.ДобавитьМассив(ВыбранноеЗначение,ИмяТЧ) КонецПроцедуры
//-выбор

//+строка поиска
&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент) СтандартнаяОбработка=Ложь; ОтборПоТексту(СтрокаПоиска) КонецПроцедуры
&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка) ОтборПоТексту("") КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка) ОтборПоТексту(Текст); КонецПроцедуры
Процедура ОтборПоТексту(Текст)
	Если Текст="" Тогда
		//вернем отображение в исходное состояние
		Если РежимПросмотра=2 Тогда Элементы.Список.Отображение=ОтображениеТаблицы.ИерархическийСписок
		ИначеЕсли РежимПросмотра=3 Тогда Элементы.Список.Отображение=ОтображениеТаблицы.Дерево
		КонецЕсли;
		РежимПросмотра=0;
		
		Список.Отбор.Элементы[1].Использование=Ложь;
	Иначе
		//переключим отображение списка в редим - Список
		//Режим просмотра (1 - Список, 2 - Иерархический список, 3 - Дерево)
		Если РежимПросмотра=0 Тогда
			Если Элементы.Список.Отображение=ОтображениеТаблицы.Дерево Тогда РежимПросмотра=3
			ИначеЕсли Элементы.Список.Отображение=ОтображениеТаблицы.ИерархическийСписок Тогда РежимПросмотра=2
			Иначе РежимПросмотра=1
			КонецЕсли;	
		КонецЕсли;	
		Если Элементы.Список.Отображение<>ОтображениеТаблицы.Список Тогда Элементы.Список.Отображение=ОтображениеТаблицы.Список КонецЕсли;
		
		Список.Отбор.Элементы[1].Использование=Истина;
		Для Каждого Эл Из Список.Отбор.Элементы[1].Элементы Цикл
			Эл.ПравоеЗначение=Текст;
			Если СпособПоиска="НачалоСтроки" Тогда Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.НачинаетсяС	
			ИначеЕсли СпособПоиска="ЧастьСтроки" Тогда Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Содержит	
			ИначеЕсли СпособПоиска="ТочноеСоответствие" Тогда
				Если Строка(Эл.ЛевоеЗначение)="НаименованиеПолное" Тогда
					Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Подобно
				Иначе
					Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры	
&НаКлиенте
Процедура СпособПоискаПриИзменении(Элемент) ОтборПоТексту(СтрокаПоиска) КонецПроцедуры
//-строка поиска
